{
  "grade1": {
    "math": [
      {
        "title": "正負の数：基準からの距離",
        "body": "0を基準点として、それより大きい数を正の数、小さい数を負の数で表す。気温、標高、収支計算など、実生活で頻繁に使われる考え方。"
      },
      {
        "title": "絶対値とは？",
        "body": "数直線上での、0からの距離のこと。なので、絶対値は常に0か正の数になる。|-3|も|+3|も、どちらも3になる。"
      },
      {
        "title": "文字式のルール①：乗算",
        "body": "数と文字の積では数を先に書き、乗算記号(×)は省略する。例：x × 5 は 5x。文字同士の場合はアルファベット順に並べるのが一般的（b × a は ab）。"
      },
      {
        "title": "文字式のルール②：除算",
        "body": "除算記号(÷)は使わず、分数の形で表す。例：a ÷ 4 は a/4。"
      },
      {
        "title": "方程式とは？",
        "body": "まだ分かっていない数（未知数x）を含む等式のこと。その等式が成り立つようなxの値を求めることを「方程式を解く」という。"
      },
      {
        "title": "移項の仕組み",
        "body": "方程式の片方の辺にある項を、符号を変えてもう片方の辺に移すこと。等式の両辺に同じ数を足したり引いたりする操作を簡略化したもの。"
      },
      {
        "title": "比例の関係",
        "body": "一方が2倍, 3倍になると、もう一方も2倍, 3倍になる関係。y = ax の式で表され、グラフは原点を通る直線になる。"
      },
      {
        "title": "反比例の関係",
        "body": "一方が2倍, 3倍になると、もう一方は1/2倍, 1/3倍になる関係。y = a/x の式で表され、グラフは双曲線と呼ばれる滑らかな曲線になる。"
      },
      {
        "title": "平面図形：おうぎ形",
        "body": "円の一部を切り取った形。弧の長さと面積は、中心角の大きさに比例する。360度のうち、中心角が何度分かを考えれば計算できる。"
      },
      {
        "title": "空間図形：回転体",
        "body": "一つの直線を軸として、平面図形を1回転させてできる立体。円柱、円錐、球などがある。"
      },
      {
        "title": "ねじれの位置",
        "body": "空間内にある2つの直線で、交わらず、かつ平行でもない関係のこと。箱の辺などを想像すると分かりやすい。"
      },
      {
        "title": "データの活用：度数分布表",
        "body": "集めたデータをいくつかの階級に分け、それぞれの階級に含まれるデータの個数（度数）をまとめた表。データの散らばり具合が一目でわかる。"
      },
      {
        "title": "ヒストグラム",
        "body": "度数分布表を、柱状のグラフで表したもの。各階級の度数を棒の高さで示す。データの分布の形を視覚的に捉えられる。"
      },
      {
        "title": "相対度数",
        "body": "度数の合計に対する、各階級の度数の割合のこと。「その階級の度数 ÷ 度数の合計」で求められる。全体のどの部分を占めるかがわかる。"
      },
      {
        "title": "平均値・最頻値・中央値",
        "body": "データの代表値。平均値は合計÷個数。最頻値(モード)は最も多く現れる値。中央値(メジアン)はデータを順に並べた時の中央の値。"
      },
      {
        "title": "素数とは？",
        "body": "1とその数自身でしか割り切れない、1より大きい整数のこと。（例：2, 3, 5, 7, 11...）全ての整数は素数の積で表せる（素因数分解）。"
      },
      {
        "title": "最小公倍数と最大公約数",
        "body": "最大公約数は、2つ以上の整数に共通する約数の中で最大のもの。最小公倍数は、共通する倍数の中で最小のもの。分数の計算などで使う。"
      },
      {
        "title": "座標平面",
        "body": "横のx軸と縦のy軸で構成される平面。点P(3, 2)のように、2つの数の組で平面上の位置を正確に示すことができる。"
      },
      {
        "title": "式の値",
        "body": "文字式の中の文字を、具体的な数に置き換えて計算した結果のこと。x=3のとき、2x+1の値は 2×3+1=7 となる。"
      },
      {
        "title": "不等式",
        "body": "「<」や「>」などの不等号を使って、数量の大小関係を表した式。「xは3より大きい」は x > 3 と表す。"
      },
      {
        "title": "項と係数",
        "body": "3x - 2y + 5 のような式で、プラスやマイナスで区切られた一つ一つのかたまり（3x, -2y, 5）が「項」。文字についている数字（3, -2）が「係数」。"
      },
      {
        "title": "一次式の計算",
        "body": "3a + 2b - a + 4b のような計算では、同じ文字の項（3aと-a、2bと4b）をまとめることができる。異なる文字の項はまとめられない。"
      },
      {
        "title": "方程式の解",
        "body": "方程式を成り立たせる文字の値のこと。例えば x + 3 = 5 の場合、x = 2 がこの方程式の解となる。"
      },
      {
        "title": "比例の式 y=ax の『a』",
        "body": "この『a』は「比例定数」と呼ばれる。yをxで割る（y/x）ことでいつでも求めることができ、その関係において常に一定の値をとる。"
      },
      {
        "title": "座標の読み方",
        "body": "点P(x, y)のx座標は、y軸から左右にどれだけ離れているかを示す。y座標は、x軸から上下にどれだけ離れているかを示す。"
      },
      {
        "title": "垂直二等分線の性質",
        "body": "線分の中点を通り、その線分に垂直な直線。この直線上のどの点をとっても、線分の両端からの距離は等しくなる。"
      },
      {
        "title": "角の二等分線の性質",
        "body": "一つの角をちょうど半分に分ける直線。この直線上のどの点をとっても、角を作る2本の辺からの距離は等しくなる。"
      },
      {
        "title": "円の接線",
        "body": "円と1点だけで接する直線のこと。円の中心と接点を結んだ半径は、その接線と必ず垂直に交わる。"
      },
      {
        "title": "立体の表面積",
        "body": "その立体のすべての面の面積の合計。展開図を描いて、それぞれの面の面積を計算し、最後にすべて足し合わせると求められる。"
      },
      {
        "title": "柱体の側面積",
        "body": "角柱や円柱の側面全体の面積は、「底面の周の長さ × 高さ」で簡単に求めることができる。"
      },
      {
        "title": "データの範囲（レンジ）",
        "body": "データの散らばり具合を表す指標の一つで、「最大値 - 最小値」で計算する。この値が大きいほど、データが広く散らばっていることがわかる。"
      },
      {
        "title": "度数の多角形（度数折れ線）",
        "body": "ヒストグラムの各長方形の上の辺の中点を、順に線分で結んで作った折れ線グラフ。全体の傾向がより滑らかに見て取れる。"
      },
      {
        "title": "加法と減法の関係",
        "body": "数を引くことは、その数の符号を変えて足すことと同じ。例えば「(+5) - (+3)」は「(+5) + (-3)」と考えることができる。"
      },
      {
        "title": "累乗",
        "body": "同じ数をいくつか掛け合わせること。3⁴ は3を4回掛け合わせるという意味。(-2)² は+4だが、-2²は-(2×2)で-4になるので注意。"
      },
      {
        "title": "四則計算の順序",
        "body": "計算の基本ルール。①括弧の中を最優先、②累乗、③掛け算・割り算、④足し算・引き算の順で計算する。"
      },
      {
        "title": "文字式の値の代入",
        "body": "x = -3 のように負の数を代入するときは、必ず括弧をつけて代入する癖をつけよう。例えば 5 - x は 5 - (-3) となり、計算ミスを防げる。"
      },
      {
        "title": "等式の性質",
        "body": "①両辺に同じ数を足しても等式は成り立つ。②両辺から同じ数を引いても成り立つ。③両辺に同じ数を掛けても成り立つ。④両辺を0でない同じ数で割っても成り立つ。"
      },
      {
        "title": "一次方程式の文章問題",
        "body": "問題文の中の「等しい関係」を見つけ出すのが第一歩。何をxとするかを決め、その関係を方程式で表せば、あとは計算するだけ。"
      },
      {
        "title": "比例のグラフ",
        "body": "y = ax のグラフは、原点(0,0)と、もう一点（例えば x=1, y=a の点）を結ぶ直線になる。a > 0 なら右上がり、a < 0 なら右下がり。"
      },
      {
        "title": "反比例のグラフ",
        "body": "y = a/x のグラフ（双曲線）は、x軸ともy軸とも決して交わらない。xの値が0になることはないため。"
      },
      {
        "title": "点対称な図形",
        "body": "ある点を中心に180度回転させたとき、元の図形にぴったり重なる図形。平行四辺形や円は点対称な図形。"
      },
      {
        "title": "線対称な図形",
        "body": "一本の直線を折り目として折ったとき、両側がぴったり重なる図形。二等辺三角形やおうぎ形、長方形は線対称な図形。"
      },
      {
        "title": "円の移動：平行移動と回転移動",
        "body": "円を平行移動させても、回転移動させても、その半径や面積は変わらない。図形の本質的な性質は移動によって変化しない。"
      },
      {
        "title": "垂直な線・平行な線",
        "body": "2直線が交わってできる角が90度のとき、2直線は垂直であるという。どこまで伸ばしても交わらない2直線は平行であるという。"
      },
      {
        "title": "最短距離の作図",
        "body": "点Pから直線Lへの最短距離は、点Pから直線Lへ下ろした垂線の長さになる。作図で垂線を引くことで求められる。"
      },
      {
        "title": "階級値",
        "body": "度数分布表の各階級の真ん中の値。「（階級の上限 + 階級の下限）÷ 2」で求められる。平均値を概算する際に使う。"
      },
      {
        "title": "（平均値）＝（階級値×度数）の合計 ÷ 度数の合計",
        "body": "度数分布表から平均値を求めるときに使う公式。一つ一つのデータがわからなくても、この方法でおおよその平均値を計算できる。"
      },
      {
        "title": "数直線",
        "body": "直線上に数を対応させたもの。数の大小関係や、正負の数の計算を視覚的に理解するのに役立つ。"
      },
      {
        "title": "文字を使った式の表し方（数量）",
        "body": "「定価a円の2割引」は a × (1 - 0.2) = 0.8a 円。「時速x kmで3時間進んだ距離」は 3x km。単位を忘れずに。"
      },
      {
        "title": "関係を表す式",
        "body": "「xとyの和は10」→ x+y=10。「1個a円のりんご5個の代金はb円」→ 5a=b。文章を数式に翻訳する練習が大切。"
      }
    ],
    "science": [
      {
        "title": "花のつくり",
        "body": "外側から、がく、花弁、おしべ、めしべの4つの部分からなる。これらが揃っている花を「完全花」という。"
      },
      {
        "title": "光合成とは？",
        "body": "植物が光のエネルギーを使い、二酸化炭素と水から、栄養分（デンプンなど）と酸素を作り出す働き。葉の葉緑体で行われる。"
      },
      {
        "title": "植物の呼吸",
        "body": "植物も動物と同じように、酸素を吸って二酸化炭素を出す呼吸を常に行っている。光合成は光がある時だけだが、呼吸は24時間行われる。"
      },
      {
        "title": "蒸散の役割",
        "body": "植物が葉の裏側にある気孔から、水蒸気を放出する現象。根から水を吸い上げる原動力になったり、体温調節の役割がある。"
      },
      {
        "title": "物質の三態",
        "body": "物質は、固体、液体、気体の3つの状態をとる。これらの状態変化は、物質を構成する粒子の運動の激しさと配列の規則性で決まる。"
      },
      {
        "title": "混合物と純粋な物質",
        "body": "食塩水のように2種類以上の物質が混ざったものが混合物。水や食塩のように1種類の物質でできているものが純粋な物質。"
      },
      {
        "title": "状態変化と温度",
        "body": "純粋な物質は、融点（固体→液体）や沸点（液体→気体）が一定の温度になる。融解中や沸騰中は、熱を加えても温度は上がらない。"
      },
      {
        "title": "光の直進と反射",
        "body": "光は均一な物質の中をまっすぐ進む（直進）。鏡などに当たると、入射角と反射角が等しくなるように反射する（反射の法則）。"
      },
      {
        "title": "光の屈折",
        "body": "光が空気中から水中へ入る時など、異なる物質へ進む際に進路が曲がる現象。水中の物が浮き上がって見えるのはこのため。"
      },
      {
        "title": "音の伝わり方",
        "body": "音は、物質の振動が波として伝わる現象。そのため、振動を伝える物質がない真空中では音は伝わらない。"
      },
      {
        "title": "力の3要素",
        "body": "力は「大きさ」「向き」「作用点」の3つの要素で決まる。これを矢印で表すことで、力の働きを視覚的に理解しやすくなる。"
      },
      {
        "title": "フックの法則",
        "body": "ばねののびは、加えた力の大きさに比例するという法則。多くのばねばかりはこの法則を利用している。"
      },
      {
        "title": "火成岩の種類",
        "body": "マグマが冷えて固まった岩石。ゆっくり冷えて固まった「深成岩」（例：花こう岩）と、急に冷えて固まった「火山岩」（例：安山岩）に大別される。"
      },
      {
        "title": "地震の波：P波とS波",
        "body": "地震が発生すると、速く伝わるP波（初期微動）と、少し遅れて伝わるS波（主要動）の2種類の波が伝わる。この到着時間の差から震源地までの距離がわかる。"
      },
      {
        "title": "地層と化石",
        "body": "地層は基本的に下のものほど古く、当時の環境を知る手がかりとなる化石が含まれていることがある。示相化石（環境を示す）と示準化石（時代を示す）がある。"
      },
      {
        "title": "身の回りの火山岩",
        "body": "安山岩は日本の火山で最も一般的。流紋岩は白っぽく、玄武岩は黒っぽいのが特徴。含まれる鉱物の違いで色が変わる。"
      },
      {
        "title": "堆積岩の種類",
        "body": "れき岩（粒が大きい）、砂岩（粒が中くらい）、泥岩（粒が小さい）は、粒の大きさで分類される。石灰岩やチャートは生物の死骸からできている。"
      },
      {
        "title": "地震の震度とマグニチュード",
        "body": "震度は「ある場所での揺れの強さ」を表す階級。マグニチュードは「地震そのもののエネルギーの大きさ」を表す。一つの地震でも、場所によって震度は違う。"
      },
      {
        "title": "凸レンズの焦点",
        "body": "レンズの軸に平行な光が、屈折して1点に集まる場所が焦点。虫眼鏡で光を集めて紙を焦がせるのはこの原理。"
      },
      {
        "title": "実像と虚像",
        "body": "凸レンズによってできる像のうち、スクリーンに映し出せるのが実像。レンズをのぞいた時にだけ見えるのが虚像。"
      },
      {
        "title": "裸子植物と被子植物",
        "body": "種子植物の二大グループ。胚珠がむき出しなのが裸子植物（マツ、イチョウなど）。胚珠が子房に包まれているのが被子植物（サクラ、アサガオなど）。"
      },
      {
        "title": "合弁花と離弁花",
        "body": "被子植物のうち、花びらが根元でくっついているのが合弁花（ツツジ、タンポポなど）。花びらが一枚一枚離れているのが離弁花（サクラ、アブラナなど）。"
      },
      {
        "title": "根の役割",
        "body": "植物の体を支えるだけでなく、水や養分を土から吸収する重要な働きを持つ。先端近くにある「根毛」で効率よく吸収している。"
      },
      {
        "title": "気孔の開閉",
        "body": "葉の裏に多くある小さな穴「気孔」は、周りにある三日月形の孔辺細胞によって開いたり閉じたりする。主に植物にとっての都合の良い時に開く。"
      },
      {
        "title": "有機物と無機物",
        "body": "炭素を含む物質が有機物（デンプン、タンパク質、プラスチックなど）。それ以外が無機物（水、食塩、鉄など）。有機物は燃やすと二酸化炭素を発生する。"
      },
      {
        "title": "気体の集め方",
        "body": "水に溶けにくい気体は「水上置換法」。水に溶けやすく空気より重い気体は「下方置換法」。水に溶けやすく空気より軽い気体は「上方置換法」で集める。"
      },
      {
        "title": "溶解度",
        "body": "一定量の溶媒（通常は水100g）に溶けることができる溶質の最大量。多くの固体は、水の温度が高いほど溶解度も大きくなる。"
      },
      {
        "title": "光の直進が作るもの",
        "body": "光がまっすぐ進むことで、「影」ができる。また、針穴写真機（ピンホールカメラ）で像が上下左右逆さまに写るのも、光の直進による現象。"
      },
      {
        "title": "凸レンズを通る光の進み方",
        "body": "①軸に平行な光は、屈折して焦点を通る。②レンズの中心を通る光は、そのまま直進する。③焦点から出た光は、屈折して軸に平行に進む。この3つが作図の基本。"
      },
      {
        "title": "音の速さ",
        "body": "空気中を伝わる音の速さは、約340m/s。光の速さ（約30万km/s）に比べて非常に遅い。雷で、光ってから音が聞こえるまでに時間がかかるのはこのため。"
      },
      {
        "title": "垂直抗力",
        "body": "物体が床や机を押すとき、床や机から垂直に押し返される力のこと。力のつり合いを考える上で重要な力の一つ。"
      },
      {
        "title": "摩擦力",
        "body": "物体が運動しようとする向きとは逆向きに働く、動きを妨げる力。接触面がざらざらしているほど、物体が重いほど大きくなる。"
      },
      {
        "title": "示準化石の条件",
        "body": "地層が堆積した時代を特定するのに役立つ化石。広い地域に分布し、限られた時代に生きていた生物の化石であることが条件。（例：アンモナイト、三葉虫）"
      },
      {
        "title": "示相化石の条件",
        "body": "地層が堆積した当時の環境を知るのに役立つ化石。生息環境が限られている生物の化石であることが条件。（例：サンゴ→暖かく浅い海、シジミ→淡水や汽水域）"
      },
      {
        "title": "プレートテクトニクス",
        "body": "地球の表面は、プレートと呼ばれる十数枚の固い岩盤で覆われているという考え方。このプレートが動くことで、地震や火山活動が起こる。"
      },
      {
        "title": "維管束とは？",
        "body": "植物の体内にある、水や養分を運ぶ管の束。人間でいう血管のようなもの。道管（水を運ぶ）と師管（栄養分を運ぶ）からなる。"
      },
      {
        "title": "単子葉類と双子葉類の維管束",
        "body": "茎の断面を見ると、双子葉類は維管束が輪のように並んでいるが、単子葉類はばらばらに散らばっている。"
      },
      {
        "title": "化学式",
        "body": "物質を、元素記号を使って表した式。例えば、水はH₂O、二酸化炭素はCO₂。分子がどの原子何個からできているかがわかる。"
      },
      {
        "title": "密度と物質",
        "body": "密度は物質によって決まった値を持つ。そのため、何の物質か不明な場合でも、体積と質量を測って密度を計算すれば、物質を特定する手がかりになる。"
      },
      {
        "title": "いろいろな気体：酸素",
        "body": "物を燃やす働き（助燃性）があり、自分自身は燃えない。空気中に約21%含まれる。水に溶けにくい。"
      },
      {
        "title": "いろいろな気体：二酸化炭素",
        "body": "石灰水を白くにごらせる性質がある。水に少し溶け、炭酸水になる。空気より重い。"
      },
      {
        "title": "いろいろな気体：水素",
        "body": "宇宙で最も多い元素。非常に軽く、燃えやすい（可燃性）。火のついたマッチを近づけると、ポンと音を立てて燃える。"
      },
      {
        "title": "いろいろな気体：アンモニア",
        "body": "特有の刺激臭があり、空気より軽く、水に非常によく溶ける。水溶液はアルカリ性を示す。"
      },
      {
        "title": "光の反射：乱反射",
        "body": "物体の表面がでこぼこしていると、光が様々な方向に反射する。このおかげで、どの角度からでもその物を見ることができる。"
      },
      {
        "title": "全反射",
        "body": "光が水中から空気中に出る時など、入射角がある角度（臨界角）より大きいと、光が屈折せずにすべて反射される現象。光ファイバーに応用されている。"
      },
      {
        "title": "力のつり合い",
        "body": "一つの物体に複数の力が働いていても、物体が静止し続けている状態。力がつり合う条件は「2つの力の大きさが等しい」「向きが反対」「一直線上にある」こと。"
      },
      {
        "title": "質量と重さ",
        "body": "質量は「物質そのものの量」で、どこで測っても変わらない（単位:g, kg）。重さは「物体に働く重力の大きさ」で、場所によって変わる（単位:N）。月面では重さは約1/6になる。"
      },
      {
        "title": "海陸風",
        "body": "沿岸部で、昼は海から陸へ（海風）、夜は陸から海へ（陸風）と、1日周期で風向きが変わる現象。陸と海の温まりやすさの違いによって起こる。"
      },
      {
        "title": "岩石の風化と侵食",
        "body": "岩石が、温度変化や雨水などによって、もろくなっていくのが風化。川の流れなどによって削られていくのが侵食。"
      },
      {
        "title": "露点",
        "body": "空気中の水蒸気が冷やされて、水滴になり始める温度。露点が高いほど、空気は湿っている（湿度が高い）と言える。"
      }
    ],
    "social": [
      {
        "title": "世界の六大陸",
        "body": "ユーラシア大陸、アフリカ大陸、北アメリカ大陸、南アメリカ大陸、オーストラリア大陸、南極大陸。これに太平洋、大西洋、インド洋の三大洋を覚えよう。"
      },
      {
        "title": "経線と緯線",
        "body": "経線は地球を縦に結ぶ線で、経度はイギリスの旧グリニッジ天文台が基準。緯線は横に結ぶ線で、緯度は赤道が基準。"
      },
      {
        "title": "時差の仕組み",
        "body": "地球が24時間で360度自転するため、経度15度ごとに1時間の時差が生じる。東へ行くほど時刻は進む。"
      },
      {
        "title": "世界の気候帯",
        "body": "熱帯、乾燥帯、温帯、冷帯（亜寒帯）、寒帯の5つに大別される。日本の大部分は温帯に属する。"
      },
      {
        "title": "世界の三大宗教",
        "body": "キリスト教、イスラム教、仏教。信者の数が多いこの3つの宗教は、世界の文化や歴史に大きな影響を与えてきた。"
      },
      {
        "title": "人類の出現",
        "body": "約700万年前にアフリカで誕生した猿人が人類の祖先とされる。直立二足歩行を始めたことが大きな特徴。"
      },
      {
        "title": "四大文明",
        "body": "メソポタミア、エジプト、インダス、中国の4つの文明。いずれも大きな川の流域で発達し、文字や法律、高度な技術を生み出した。"
      },
      {
        "title": "古代ギリシャの民主政治",
        "body": "都市国家アテネで発達。市民である男性が民会に参加し、国の重要な決定を直接行う「直接民主制」が特徴。"
      },
      {
        "title": "シルクロード（絹の道）",
        "body": "古代中国から地中海世界までを結んだ交易路。絹だけでなく、文化や宗教、技術が東西を行き交う重要な道だった。"
      },
      {
        "title": "縄文時代",
        "body": "約1万年以上続いた、狩りや採集を中心とした時代。縄目の文様がある縄文土器や、ゴミ捨て場である貝塚が特徴。"
      },
      {
        "title": "弥生時代",
        "body": "大陸から稲作が伝わり、本格的な農耕が始まった時代。食料をめぐる争いから「クニ」が形成されていった。"
      },
      {
        "title": "古墳時代",
        "body": "大仙古墳（仁徳天皇陵）に代表される巨大な古墳が作られた時代。大和政権による日本の統一が進んだ。"
      },
      {
        "title": "聖徳太子",
        "body": "推古天皇の摂政として、冠位十二階や十七条の憲法を定め、天皇中心の中央集権国家の基礎を築いた。"
      },
      {
        "title": "大化の改新",
        "body": "645年、中大兄皇子らが蘇我氏を倒して始めた政治改革。豪族の土地と人民を国家が直接支配する「公地公民」を目指した。"
      },
      {
        "title": "奈良時代と大仏",
        "body": "都が平城京に置かれた時代。聖武天皇が仏教の力で国を守ろうと、東大寺に大仏を造立した。"
      },
      {
        "title": "アジア州の特色",
        "body": "世界最大の面積と人口を誇る州。米作が盛んな東南アジア、乾燥した気候の西アジアなど、多様な自然環境と文化を持つ。"
      },
      {
        "title": "ヨーロッパ州の特色",
        "body": "多くの国が陸続きで、EU（ヨーロッパ連合）を結成して経済的な結びつきを強めている。緯度が高い割に、偏西風と暖流の影響で比較的温暖。"
      },
      {
        "title": "アフリカ州の特色",
        "body": "赤道を中心に広がり、広大なサバンナや砂漠が見られる。かつてヨーロッパの植民地だった国が多く、カカオやコーヒーなどのプランテーション農業が盛ん。"
      },
      {
        "title": "北アメリカ州の特色",
        "body": "アメリカ、カナダ、メキシコなどからなる。適材適所の考え方で、広大な土地を利用した大規模な農業や工業が行われている。"
      },
      {
        "title": "南アメリカ州の特色",
        "body": "アンデス山脈やアマゾン川など、雄大な自然が広がる。ブラジルではコーヒー、アルゼンチンでは小麦など、農産物の生産が盛ん。"
      },
      {
        "title": "国土地理院の地図記号",
        "body": "学校、病院、神社、寺院、交番など、土地の使われ方や建物を表す記号。その土地の様子を効率的に読み取るために作られた。"
      },
      {
        "title": "等高線",
        "body": "地図上で、同じ標高の地点を結んだ線。等高線の間隔が狭いほど、その場所の傾斜は急であることを示す。"
      },
      {
        "title": "縮尺",
        "body": "実際の距離を、地図上でどれくらいの長さに縮めたかを示す割合。2万5千分の1の地図では、地図上の1cmが実際には250mになる。"
      },
      {
        "title": "世界の様々な住居",
        "body": "寒い地域では壁の厚い家、雨が多い地域では高床式の家、暑く乾燥した地域では日干しレンガの家など、住居はその土地の気候風土に深く関係している。"
      },
      {
        "title": "三大穀物",
        "body": "米、小麦、トウモロコシ。世界の多くの人々の主食となっており、生産量も非常に多い。"
      },
      {
        "title": "古代ローマの文化",
        "body": "ギリシャ文化を受け継ぎながら、法律や建築、土木技術などの実用的な分野で優れた文化を発展させた。コロッセオや水道橋が有名。"
      },
      {
        "title": "キリスト教の成立",
        "body": "パレスチナ地方でイエスによって説かれた。すべての人間を愛する「無償の愛（アガペー）」を説き、ローマ帝国下で迫害されながらも広まっていった。"
      },
      {
        "title": "イスラム教の成立",
        "body": "7世紀にアラビア半島でムハンマドによって開かれた。唯一神アッラーへの絶対的な服従を教え、偶像崇拝を厳しく禁じた。"
      },
      {
        "title": "飛鳥文化",
        "body": "7世紀前半、推古天皇の時代に栄えた日本最初の仏教文化。聖徳太子が建てた法隆寺がその代表。"
      },
      {
        "title": "天平文化",
        "body": "奈良時代、聖武天皇の時代に栄えた、仏教と唐の文化の影響が強い文化。東大寺の大仏や、正倉院の宝物などが有名。"
      },
      {
        "title": "国風文化",
        "body": "平安時代中期、遣唐使が廃止された後に生まれた、日本の風土に合った優雅な貴族文化。かな文字が使われ、『源氏物語』などが生まれた。"
      },
      {
        "title": "現代社会の課題：少子高齢化",
        "body": "子供の数が減り、高齢者の割合が増えている社会問題。労働力不足や、年金・医療などの社会保障制度の維持が大きな課題となっている。"
      },
      {
        "title": "現代社会の課題：食料問題",
        "body": "世界的には食料は十分生産されているが、貧困や紛争により、一部の地域では飢餓に苦しむ人々がいる。食品ロスも大きな問題。"
      },
      {
        "title": "人権の歴史",
        "body": "人権は、王や君主の支配から自由を勝ち取る中で、徐々に確立されてきた。アメリカ独立宣言やフランス人権宣言などが重要な一歩となった。"
      },
      {
        "title": "国際社会と日本",
        "body": "日本は、貿易や国際協力、文化交流などを通じて、世界の国々と深く結びついている。国際社会の一員としての役割が求められている。"
      }
    ],
    "japanese": [
      {
        "title": "品詞とは？",
        "body": "単語を文法上の性質によって分類したもの。名詞、動詞、形容詞などがある。品詞を理解すると文の構造がわかりやすくなる。"
      },
      {
        "title": "自立語と付属語",
        "body": "自立語はそれだけで文節を作れる単語（例：犬、走る）。付属語は自立語につかないと文節を作れない単語（例：助詞の「が」、助動詞の「ない」）。"
      },
      {
        "title": "活用とは？",
        "body": "下に続く言葉によって、単語の形が変わること。動詞、形容詞、形容動詞、助動詞は活用がある（用言）。"
      },
      {
        "title": "動詞の活用の種類",
        "body": "五段活用、上一段活用、下一段活用、カ行変格活用、サ行変格活用の5種類。未然形に「ない」をつけて見分けるのが基本。"
      },
      {
        "title": "文の成分",
        "body": "文を意味のまとまり（文節）で区切ったとき、それぞれの文節が持つ役割のこと。主語、述語、修飾語、接続語、独立語がある。"
      },
      {
        "title": "主語と述語",
        "body": "文の骨格を作る最も重要な成分。「何が・誰が」にあたるのが主語、「どうする・どんなだ・なんだ」にあたるのが述語。"
      },
      {
        "title": "修飾語",
        "body": "他の文節を詳しく説明する成分。連体修飾語は体言（名詞）を、連用修飾語は用言（動詞・形容詞など）を修飾する。"
      },
      {
        "title": "詩の表現技法：直喩と隠喩",
        "body": "直喩は「～のようだ」のように、たとえとわかる形で表現する。隠喩（メタファー）は「～のようだ」を使わず、「君は太陽だ」のように断定する。"
      },
      {
        "title": "詩の表現技法：擬人法",
        "body": "人間でないものを、人間のように見立てて表現する技法。「空が泣いている」のように、感情や行動を持たせる。"
      },
      {
        "title": "物語の三要素",
        "body": "小説や物語を構成する基本的な要素は「登場人物」「設定（時・場所）」「筋（あらすじ）」。これを意識して読むと内容を整理しやすい。"
      },
      {
        "title": "漢文のレ点",
        "body": "漢字の左下につく記号で、「すぐ下の漢字を先に読んでから、上の漢字に戻って読め」というしるし。返り点の一種。"
      },
      {
        "title": "漢文の一・二点",
        "body": "一・二点は、間に他の漢字を挟んで、二点のついた字を飛ばして一点の字を先に読む、というルール。"
      },
      {
        "title": "故事成語：矛盾",
        "body": "「どんな盾も突き通す矛」と「どんな矛も防ぐ盾」を売っていた商人の話から。つじつまが合わないことのたとえ。"
      },
      {
        "title": "竹取物語",
        "body": "日本最古の物語とされる。かぐや姫が求婚者たちに無理難題を突きつけ、最後は月に帰っていく話。"
      },
      {
        "title": "枕草子",
        "body": "清少納言によって書かれた、平安時代の随筆。「春はあけぼの」から始まり、作者の鋭い観察眼や感性が「をかし」という言葉で表現されている。"
      },
      {
        "title": "単語の区切り方",
        "body": "文を意味がわかる範囲でできるだけ短く区切ったものが文節。「ネ」を入れてみて不自然でなければ、そこで区切れることが多い。"
      },
      {
        "title": "指示語（こそあど言葉）",
        "body": "「これ、それ、あれ、どれ」など、物事を指し示す言葉。文章を読むときは、指示語が具体的に何を指しているかを正確に捉えることが大切。"
      },
      {
        "title": "接続詞",
        "body": "文と文、文節と文節の関係を示す言葉。順接（だから）、逆接（しかし）、並立（また）、添加（そして）、選択（あるいは）、転換（さて）などがある。"
      },
      {
        "title": "感動詞",
        "body": "感動、呼びかけ、応答などを表し、他の文節とは直接関係なく独立して使われる言葉。「ああ」「もしもし」「はい」など。"
      },
      {
        "title": "音読みと訓読み",
        "body": "音読みは、中国での発音をもとにした読み方。訓読みは、その漢字が持つ意味にあたる日本語をあてた読み方。"
      },
      {
        "title": "文節相互の関係",
        "body": "主語・述語の関係、修飾・被修飾の関係、並立の関係、補助の関係、接続の関係がある。文の構造を正確に捉えるために重要。"
      },
      {
        "title": "連体詞と連用詞",
        "body": "どちらも自立語で活用がなく、他の言葉を修飾する。連体詞は体言（名詞）にのみ続き（例：大きな、あらゆる）、連用詞は用言（動詞など）に続く（例：とても、ゆっくり）。"
      },
      {
        "title": "助詞の種類",
        "body": "格助詞（が、を、に）、接続助詞（て、ば、と）、副助詞（は、も、こそ）、終助詞（ね、よ、か）など。文節間の関係を示したり、意味を添えたりする。"
      },
      {
        "title": "助動詞の種類",
        "body": "れる・られる（受身・可能・自発・尊敬）、せる・させる（使役）、ない（打消）、う・よう（意志・推量）など、様々な意味を動詞に付け加える。"
      },
      {
        "title": "敬体と常体",
        "body": "文末が「です・ます」調なのが敬体（丁寧体）。「だ・である」調なのが常体（普通体）。レポートや論文では常体、手紙などでは敬体が主に使われる。"
      },
      {
        "title": "倒置法",
        "body": "文の順序を入れ替えて、特定の言葉を強調する表現技法。「見たんだ、僕は、その瞬間を」のように、感動や驚きを表現する時によく使われる。"
      },
      {
        "title": "呼びかけ（頓呼法）",
        "body": "文章の途中で、人や物に呼びかける形の表現。「おお、神よ」のように、読者の注意を引きつけ、感情を高める効果がある。"
      },
      {
        "title": "省略法",
        "body": "文の一部を省略することで、かえって読者の想像力を刺激し、余韻を残す表現。「言わぬが花」の美学。"
      },
      {
        "title": "熟字訓",
        "body": "漢字二字以上の熟語に、特別な訓読みをあてたもの。「梅雨（つゆ）」「大人（おとな）」「五月雨（さみだれ）」など。知識として覚える必要がある。"
      },
      {
        "title": "類義語と対義語",
        "body": "類義語は意味が似ている語（例：うれしい、よろこばしい）。対義語は意味が反対の語（例：成功、失敗）。語彙力を増やす基本。"
      },
      {
        "title": "ことわざと慣用句",
        "body": "ことわざは教訓や風刺を含む短い句（例：石の上にも三年）。慣用句は二語以上の組み合わせで、特別な意味になる言葉（例：油を売る）。"
      },
      {
        "title": "話し言葉と書き言葉",
        "body": "話し言葉は日常会話で使うくだけた言葉。書き言葉は文章で使う改まった言葉。「やっぱり→やはり」「すごく→とても」のように使い分ける。"
      },
      {
        "title": "詩の形式：定型詩と自由詩",
        "body": "定型詩は、五七調や七五調のように、音の数に決まったリズムがある詩。自由詩は、形式にとらわれず自由に表現する詩。"
      },
      {
        "title": "小説のプロット",
        "body": "物語の筋立てや構想のこと。通常、「発端→展開→クライマックス→結末」という流れで構成される。"
      },
      {
        "title": "登場人物の心情の読み取り",
        "body": "登場人物の「行動」「会話」「表情や情景の描写」から、その人物が何を感じ、考えているのかを推測することが読解の鍵。"
      }
    ],
    "english": [
      {
        "title": "Be動詞と一般動詞",
        "body": "Be動詞(am, is, are)は「状態」や「存在」を表す（～です、～にいる）。それ以外の「動き」を表す動詞が一般動詞（play, runなど）。"
      },
      {
        "title": "三人称・単数・現在形 (三単現)",
        "body": "主語が「I, you以外の単数」で、文が現在形のとき、一般動詞の最後にsが付くルール。「He plays tennis.」など。"
      },
      {
        "title": "疑問詞 (5W1H)",
        "body": "When(いつ), Where(どこで), Who(だれが), What(なにを), Why(なぜ), How(どのように)。文の頭に置くことで、具体的な情報を尋ねる疑問文になる。"
      },
      {
        "title": "複数形のsと三単現のs",
        "body": "名詞の最後に付くsは「複数形」（例: apples）。動詞の最後に付くsは「三単現」。働きが全く違うので混同しないように注意。"
      },
      {
        "title": "There is / There are",
        "body": "「～があります、～がいます」と、人や物の存在を表す表現。後に続く名詞が単数か複数かでisとareを使い分ける。"
      },
      {
        "title": "冠詞 a/an と the",
        "body": "a/anは「たくさんある中のどれか一つ」というニュアンス。theは「聞き手も知っている、特定の一つ」を指す。会話の中で特定されたものに付く。"
      },
      {
        "title": "a と an の使い分け",
        "body": "次に続く単語の「発音」が母音（ア,イ,ウ,エ,オ）で始まるときにanを使う。綴りではなく音が基準なので、an hour のようにhが発音されない単語にも注意。"
      },
      {
        "title": "命令文",
        "body": "主語を省略し、動詞の原形で文を始める。「～しなさい」という意味になる。「Be quiet.」のようにBe動詞で始めることもある。"
      },
      {
        "title": "現在進行形 (be動詞 + -ing)",
        "body": "「今まさに～している」という、現在進行中の動作を表す。be動詞と動詞の-ing形がセットで使われる。"
      },
      {
        "title": "代名詞",
        "body": "一度出てきた名詞の繰り返しを避けるために使う言葉。I, you, he, she, it など。主格（～は）、所有格（～の）、目的格（～を）で形が変わる。"
      },
      {
        "title": "Canの用法",
        "body": "「～できる」という能力・可能性を表すだけでなく、「～してもよい」という許可や、「～してくれますか？」という依頼の意味でも使われる。"
      },
      {
        "title": "曜日・月の頭文字",
        "body": "英語では、曜日(Monday, Sundayなど)や月(January, Augustなど)の頭文字は、文の途中でも必ず大文字で書くルールがある。"
      },
      {
        "title": "前置詞 at, on, in (時)",
        "body": "時を表す場合、atは時刻(at 7 o'clock)、onは日付や曜日(on Sunday)、inは月や年、季節(in August, in 2025)のように、時間の規模で使い分ける。"
      },
      {
        "title": "前置詞 at, on, in (場所)",
        "body": "場所を表す場合、atは具体的な地点(at the station)、onは表面への接触(on the desk)、inは空間の内部(in the box)というイメージで使い分ける。"
      },
      {
        "title": "What's up?",
        "body": "「元気？」「最近どう？」といった意味で使われる、非常にカジュアルな挨拶。How are you? よりも親しい間柄で使われることが多い。"
      },
      {
        "title": "過去形と過去分詞",
        "body": "過去形は「～した」という過去の動作を表す。過去分詞は受動態や現在完了形で使われる形で、動詞の変化を覚えることが重要。"
      },
      {
        "title": "不規則動詞",
        "body": "go-went-goneのように、過去形・過去分詞が-edを付ける規則から外れた変化をする動詞。基本的なものは暗記が必須。"
      },
      {
        "title": "助動詞 must",
        "body": "「～しなければならない」という義務と、「～にちがいない」という強い推量の2つの意味を持つ。文脈で判断する。"
      },
      {
        "title": "助動詞 may",
        "body": "「～してもよい」という許可と、「～かもしれない」という推量を表す。canよりも丁寧な許可の表現になる。"
      },
      {
        "title": "助動詞 should",
        "body": "「～すべきだ」という助言や提案を表す。mustほどの強制力はないが、道徳的な義務感を含むことが多い。"
      },
      {
        "title": "whose (所有格の関係代名詞)",
        "body": "「その人の～が」という意味で、人や物の所有関係を表す。「I know a boy whose father is a doctor.（私は父が医者である少年を知っている）」"
      },
      {
        "title": "動名詞だけを目的語にとる動詞",
        "body": "enjoy, finish, stop, mind, practice など。これらの動詞の後には、to不定詞ではなく、-ing形が来る。「I enjoy playing tennis.」"
      },
      {
        "title": "不定詞だけを目的語にとる動詞",
        "body": "want, hope, wish, decide など。未来志向の意味を持つ動詞が多い。これらの動詞の後には、-ing形ではなく、to doが来る。「I want to be a pilot.」"
      },
      {
        "title": "look forward to -ing",
        "body": "「～するのを楽しみにしている」という重要な熟語。この to は前置詞なので、後ろには動詞の原形ではなく、名詞か動名詞(-ing)が来る。"
      },
      {
        "title": "数字の読み方：1,000以上",
        "body": "1,000は a thousand。10,000は ten thousand。100,000は a hundred thousand。1,000,000は a million。3桁ごとに区切りが変わる。"
      },
      {
        "title": "序数 (first, second, third...)",
        "body": "順番を表す数。日付（July 1st）や階数（the second floor）などで使う。1, 2, 3以外は、基本的に数字の最後に-thを付ける。"
      },
      {
        "title": "不可算名詞",
        "body": "決まった形がなく、数えられない名詞のこと。water, air, money, information, adviceなど。a/anを付けたり、複数形のsを付けたりできない。"
      },
      {
        "title": "by と until の違い",
        "body": "どちらも「～まで」と訳すが、byは「期限（～までに終わらせる）」を表す。untilは「継続（～までずっと続く）」を表す。"
      },
      {
        "title": "for と during の違い",
        "body": "forは「期間の長さ」を表す（for three days）。duringは「特定の期間の中」を表す（during the vacation）。"
      },
      {
        "title": "another, other, the other",
        "body": "anotherは「不特定のもう一つ」。otherは形容詞的に「他の」。the otherは「2つのうちの残り一つ」。the othersは「複数のうちの残り全部」。"
      },
      {
        "title": "too と either",
        "body": "肯定文に同意して「私も～です」と言うときは too を使う。「I like sushi, too.」否定文に同意して「私も～でない」と言うときは either を使う。「I don't like natto, either.」"
      },
      {
        "title": "must not と don't have to",
        "body": "must notは「～してはいけない」という強い禁止。don't have toは「～する必要はない」という不必要を表す。意味が全く違うので注意。"
      },
      {
        "title": "間接疑問文",
        "body": "疑問詞で始まる文が、別の文の一部になる形。「I don't know where he lives.」のように、語順が「疑問詞 + 主語 + 動詞」になるのがポイント。"
      },
      {
        "title": "exciting と excited",
        "body": "-ing形は「（人を）～させる」という能動的な意味。「This game is exciting.（この試合はワクワクさせる）」。-ed形は「（人が）～させられる」という受動的な意味。「I am excited.（私はワクワクさせられている）」"
      },
      {
        "title": "英語のアクセント",
        "body": "単語の中の、強く発音する部分。アクセントの位置が違うと、意味が変わったり、通じなかったりすることがある。辞書で必ず確認する癖をつけよう。"
      }
    ]
  },
  "grade2": {},
  "grade3": {}
}
